<a href="https://colab.research.google.com/github/lalitgarg12/python-exercises/blob/master/Minimal_Sufficient_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Minimally Sufficient Pandas - All sources referenced from Ted Petrou Github repository

In [0]:
import pandas as pd

In [8]:
df = pd.read_csv('https://raw.githubusercontent.com/lalitgarg12/python-exercises/master/sample_data.csv',index_col=0)
df

          state  color favorite food  age  height  score  count
name
Jane         NY   blue         Steak   30     165    4.6     10
Niko         TX  green          Lamb    2      70    8.3      4
Aaron        FL    red         Mango   12     120    9.0      3
Penelope     AL  white         Apple    4      80    3.3     12
Dean         AK   gray        Cheese   32     180    1.8      8
Christina    TX  black         Melon   33     172    9.5     99
Cornelia     TX    red         Beans   69     150    2.2     44

**Selection with the brackets**

Placing a column name in the brackets appended to a DataFrame selects a single column of a DataFrame as a Series.

In [4]:
df['state']

Jane         NY
Niko         TX
Aaron        FL
Penelope     AL
Dean         AK
Christina    TX
Cornelia     TX
Name: state, dtype: object

**Selection with dot notation**

Alternatively, you may select a single column with dot notation. Simply, place the name of the column after the dot operator. The output is the exact same as above.

In [5]:
df.state

Jane         NY
Niko         TX
Aaron        FL
Penelope     AL
Dean         AK
Christina    TX
Cornelia     TX
Name: state, dtype: object

**Issues with the dot notation**

There are three issues with using dot notation. It doesnâ€™t work in the following situations:

- When there are spaces in the column name
- When the column name is the same as a DataFrame method
- When the column name is a variable

In [6]:
df.favorite food

SyntaxError: ignored

You can only use the brackets to select columns with spaces.

In [9]:
df['favorite food']

name
Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: favorite food, dtype: object

**The column name is the same as a DataFrame method**

When a column name and a DataFrame method collide, Pandas will always reference the method and not the column name. For instance, the column namecount is a method and will be referenced when using dot notation. This actually doesnâ€™t produce an error as Python allows you to reference methods without calling them. Letâ€™s reference this method now.

In [10]:
df.count

<bound method DataFrame.count of           state  color favorite food  age  height  score  count
name
Jane         NY   blue         Steak   30     165    4.6     10
Niko         TX  green          Lamb    2      70    8.3      4
Aaron        FL    red         Mango   12     120    9.0      3
Penelope     AL  white         Apple    4      80    3.3     12
Dean         AK   gray        Cheese   32     180    1.8      8
Christina    TX  black         Melon   33     172    9.5     99
Cornelia     TX    red         Beans   69     150    2.2     44>

Regardless, itâ€™s clear that using dot notation did not select a single column of the DataFrame as a Series. Again, you must use the brackets when selecting a column with the same name as a DataFrame method.

In [11]:
df['count']

name
Jane         10
Niko          4
Aaron         3
Penelope     12
Dean          8
Christina    99
Cornelia     44
Name: count, dtype: int64

**Guidance: Use the brackets for selecting a column of data**

The dot notation provides no additional functionality over the brackets and does not work in all situations. Therefore, I never use it. Its single advantage is three fewer keystrokes.

**Performance comparison iloc vs iat vs NumPy**

Letâ€™s compare the perfomance of selecting a single cell with iloc, iat and a NumPy array. Here we create a NumPy array with 100k rows and 5 columns containing random data. We then create a DataFrame out of it and make the selections.

In [12]:
import numpy as np
a = np.random.rand(10 ** 5, 5)
df1 = pd.DataFrame(a)
row = 50000
col = 3
%timeit df1.iloc[row, col]

The slowest run took 35.43 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 7.62 Âµs per loop

In [13]:
%timeit df1.iat[row, col]

The slowest run took 26.59 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 5.06 Âµs per loop

In [14]:
%timeit a[row, col]

The slowest run took 70.95 times longer than the fastest. This could mean that an intermediate result is being cached.
10000000 loops, best of 3: 176 ns per loop

**Guidance:** Use **NumPy** arrays if your application relies on performance for selecting a single cell of data and **not at or iat**.

**Method Duplication**

There are multiple methods in Pandas that do the exact same thing. Whenever two methods share the same exact underlying functionality, we say that they are aliases of each other. Having duplication in a library is completely unnecessary, pollutes the namespace and forces analysts to remember one more bit of information about a library.

This next section covers several instances of duplication along with other instances of methods that are very similar to one another.

**read_csv vs read_table duplication**

In [16]:
college = pd.read_csv('https://raw.githubusercontent.com/lalitgarg12/python-exercises/master/college.csv')
college.head()

                                instnm  ... grad_debt_mdn_supp
0             Alabama A & M University  ...              33888
1  University of Alabama at Birmingham  ...            21941.5
2                   Amridge University  ...              23370
3  University of Alabama in Huntsville  ...              24097
4             Alabama State University  ...            33118.5

[5 rows x 27 columns]

In [0]:
college2 = pd.read_table('https://raw.githubusercontent.com/lalitgarg12/python-exercises/master/college.csv', delimiter=',')

In [18]:
college.equals(college2)

True

**Guidance: Only use read_csv to read in delimitted text files**

**isna vs isnull and notna vs notnull**

The isna and isnull methods both determine whether each value in the DataFrame is missing or not. The result will always be a DataFrame (or Series) of all boolean values.

In [19]:
college_isna = college.isna()
college_isnull = college.isnull()
college_isna.equals(college_isnull)

True

**Guidance: Use only isna and notna**